from colorama import Fore
from os import system

Nemila="😺🚑 Veterinarska stanica Zevet 🚑🐶"
Veterinarska_stanica_Zevet_adr="Patriotske lige, Nemila"
Veterinarska_stanica_Zevet_prv="00:00"
Veterinarska_stanica_Zevet_krv="24:00"
Veterinarska_stanica_Zevet_br="062 343 422"

Uzunovića_put="🐶🚑 Veterinarska stanica Zenivet 🚑😺"
Veterinarska_stanica_Zenivet_adr="Uzunovića put, Zenica 72000"
Veterinarska_stanica_Zenivet_prv="09:00"
Veterinarska_stanica_Zenivet_krv="14:00"
Veterinarska_stanica_Zenivet_br="032 436 266"

Štrosmajerova="😺🚑 Veterinarska stanica Weta 🚑🐶"
Veterinarska_stanica_Weta_adr="Štrosmajerova 60, Zenica 72000"
Veterinarska_stanica_Weta_prv="08:00"
Veterinarska_stanica_Weta_krv="15:30"
Veterinarska_stanica_Weta_br="032 423 257"

def Šape():
    print("⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛")
    print("⬛⬛🟧⬛⬛⬛🟧⬛🟧🟧🟧🟧⬛🟧🟧🟧🟧🟧⬛🟧🟧🟧🟧⬛🟧🟧🟧⬛⬛🟧⬛🟧⬛⬛⬛🟧⬛⬛⬛🟧⬛⬛⬛🟧🟧🟧⬛⬛⬛⬛🟧🟧⬛🟧⬛🟧⬛🟧🟧🟧🟧⬛⬛⬛")
    print("⬛⬛🟧⬛⬛⬛🟧⬛🟧⬛⬛⬛⬛⬛⬛🟧⬛⬛⬛🟧⬛⬛⬛⬛🟧⬛⬛🟧⬛🟧⬛🟧🟧⬛⬛🟧⬛⬛🟧⬛🟧⬛⬛🟧⬛⬛🟧⬛⬛🟧⬛⬛⬛🟧⬛🟧⬛🟧⬛⬛⬛⬛⬛⬛")
    print("⬛⬛🟧⬛⬛⬛🟧⬛🟧🟧🟧⬛⬛⬛⬛🟧⬛⬛⬛🟧🟧🟧⬛⬛🟧⬛⬛🟧⬛🟧⬛🟧⬛🟧⬛🟧⬛⬛🟧⬛🟧⬛⬛🟧⬛⬛🟧⬛⬛⬛🟧⬛⬛🟧🟧⬛⬛🟧🟧🟧⬛⬛⬛⬛")
    print("⬛⬛⬛🟧⬛🟧⬛⬛🟧⬛⬛⬛⬛⬛⬛🟧⬛⬛⬛🟧⬛⬛⬛⬛🟧⬛🟧⬛⬛🟧⬛🟧⬛⬛🟧🟧⬛🟧🟧🟧🟧🟧⬛🟧⬛🟧⬛⬛🟧⬛⬛🟧⬛🟧⬛🟧⬛🟧⬛⬛⬛⬛⬛⬛")
    print("⬛⬛⬛⬛🟧⬛⬛⬛🟧🟧🟧🟧⬛⬛⬛🟧⬛⬛⬛🟧🟧🟧🟧⬛🟧⬛⬛🟧⬛🟧⬛🟧⬛⬛⬛🟧⬛🟧⬛⬛⬛🟧⬛🟧⬛⬛🟧⬛⬛🟧🟧⬛⬛🟧⬛🟧⬛🟧🟧🟧🟧⬛⬛⬛")
    print("⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛")
    print("⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛🟧🟧🟧⬛🟧🟧🟧⬛⬛⬛🟧⬛⬛⬛🟧⬛⬛🟧⬛🟧⬛🟧🟧🟧⬛🟧🟧🟧⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛")
    print("⬛⬛⬛⬛🟧🟧⬛⬛⬛⬛⬛⬛⬛⬛🟧⬛⬛⬛⬛🟧⬛⬛⬛🟧⬛🟧⬛⬛🟧🟧⬛🟧⬛🟧⬛🟧⬛⬛⬛🟧⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛🟧🟧⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛")
    print("⬛⬛🟧⬛🟧🟧⬛🟧⬛⬛⬛⬛⬛⬛🟧🟧🟧⬛⬛🟧⬛⬛🟧🟧🟧🟧🟧⬛🟧⬛🟧🟧⬛🟧⬛🟧⬛⬛⬛🟧🟧⬛⬛⬛⬛⬛⬛⬛⬛🟧⬛🟧🟧⬛🟧⬛⬛⬛⬛⬛⬛⬛⬛⬛")
    print("⬛⬛🟧⬛⬛⬛⬛🟧⬛⬛⬛⬛⬛⬛⬛⬛🟧⬛⬛🟧⬛⬛🟧⬛⬛⬛🟧⬛🟧⬛⬛🟧⬛🟧⬛🟧⬛⬛⬛🟧⬛⬛⬛⬛⬛⬛⬛⬛⬛🟧⬛⬛⬛⬛🟧⬛⬛⬛⬛⬛⬛⬛⬛⬛")
    print("⬛⬛⬛⬛🟧🟧⬛⬛⬛⬛⬛⬛⬛⬛🟧🟧🟧⬛⬛🟧⬛⬛🟧⬛⬛⬛🟧⬛🟧⬛⬛🟧⬛🟧⬛🟧🟧🟧⬛🟧🟧🟧⬛⬛⬛⬛⬛⬛⬛⬛⬛🟧🟧⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛")
    print("⬛⬛⬛🟧🟧🟧🟧⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛🟧🟧🟧🟧⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛")
    print("⬛⬛⬛🟧🟧🟧🟧⬛⬛⬛⬛🟧🟧🟧🟧🟧🟧⬛⬛🟧🟧🟧🟧⬛⬛🟧⬛⬛⬛🟧⬛⬛🟧⬛⬛⬛🟧🟧⬛⬛⬛⬛⬛🟧⬛⬛⬛⬛⬛⬛🟧🟧🟧🟧⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛")
    print("⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛🟧⬛⬛⬛🟧⬛⬛⬛⬛⬛🟧🟧⬛⬛🟧⬛⬛🟧⬛⬛🟧⬛⬛🟧⬛⬛⬛🟧⬛🟧⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛")
    print("⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛🟧⬛⬛⬛⬛🟧🟧🟧⬛⬛⬛🟧⬛🟧⬛🟧⬛⬛🟧⬛⬛🟧⬛⬛⬛⬛⬛⬛🟧⬛🟧⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛")
    print("⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛🟧⬛⬛⬛⬛⬛🟧⬛⬛⬛⬛⬛🟧⬛⬛🟧🟧⬛⬛🟧⬛⬛🟧⬛⬛⬛⬛⬛⬛🟧🟧🟧⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛")
    print("⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛🟧⬛⬛⬛⬛⬛⬛🟧⬛⬛⬛⬛⬛🟧⬛⬛⬛🟧⬛⬛🟧⬛⬛🟧⬛⬛🟧⬛⬛🟧⬛⬛⬛🟧⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛")
    print("⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛🟧🟧🟧🟧🟧🟧⬛⬛🟧🟧🟧🟧⬛⬛🟧⬛⬛⬛🟧⬛⬛🟧⬛⬛⬛🟧🟧⬛⬛⬛🟧⬛⬛⬛🟧⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛")
    print("⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛")

def Naslov():
    system('cls')
    Šape()
    print()
    print(Fore.CYAN+"                                                                                                          Radio: Tarik Ganić")
    print(Fore.BLUE+"___________________________________________________________________________________________________________________________________")
Naslov()
print(Fore.YELLOW)
Ulica=input("🐶Molimo unesite ulicu u kojoj se nalazite kako bismo našli Vama najbližu veterinarsku stanicu: ")
print(Fore.BLUE)

while True:
    if Ulica=="Nemila"or Ulica=="nemila":
        print(Fore.CYAN+"Najbliža stanica vam je:",Nemila)
        print(Fore.BLUE+Veterinarska_stanica_Zevet_adr,". Radno vrijeme:",Veterinarska_stanica_Zevet_prv,"-",Veterinarska_stanica_Zevet_krv,", a više informacija možete dobiti na:",Veterinarska_stanica_Zevet_br)
    elif Ulica=="Uzunovića put"or Ulica=="uzunovića put"or Ulica=="Uzunovica put"or Ulica=="uzunovica put":
        print(Fore.CYAN+"Najbliža stanica vam je:",Uzunovića_put)
        print(Fore.BLUE+Veterinarska_stanica_Zenivet_adr,". Radno vrijeme:",Veterinarska_stanica_Zenivet_prv,"-",Veterinarska_stanica_Zenivet_krv,", a više informacija možete dobiti na:",Veterinarska_stanica_Zenivet_br)
    elif Ulica=="Štrosmajerova"or Ulica=="štrosmajerova"or Ulica=="strosmajerova"or Ulica=="Strosmajerova":
        print(Fore.CYAN+"Najbliža stanica vam je:",Štrosmajerova)
        print(Fore.BLUE+Veterinarska_stanica_Weta_adr,". Radno vrijeme:",Veterinarska_stanica_Weta_prv,"-",Veterinarska_stanica_Weta_krv,", a više informacija možete dobiti na:",Veterinarska_stanica_Weta_br)
    else:
        print(Fore.RED+"Žao nam je, ali nema veterinarske stanice u ",Ulica," ulici, a možda vam ni ove veterinarske stanice nisu daleko!:")
        print(Fore.BLUE)
        print(Nemila,Veterinarska_stanica_Zevet_adr,Veterinarska_stanica_Zevet_br)
        print(Fore.CYAN+Uzunovića_put,Veterinarska_stanica_Zenivet_adr,Veterinarska_stanica_Zenivet_br)
        print(Fore.BLUE+Štrosmajerova,Veterinarska_stanica_Weta_adr,Veterinarska_stanica_Weta_br)
    print(Fore.YELLOW+"----------------------------------------------------------------------------------------------------------------------------------------")
    input("Dalje (ENTER)-->")
    Naslov()
    print(Fore.YELLOW)
    Ulica=input("Možete ponovo unijeti ulicu u kojoj se nalazite kako bismo našli Vama najbližu veterinarsku stanicu: ")
    print()